# PointOnEdge Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointOnEdge Class
Members See Also
---
Define a ReferencePoint relative to a referenceable edge or curve on another element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class PointOnEdge : PointElementReference
```

Visual Basic
---
```text
Public Class PointOnEdge _
	Inherits PointElementReference
```

Visual C++
---
```text
public ref class PointOnEdge : public PointElementReference
```

# Remarks
The ReferencePoint's X basis vector is constrained to the tangent vector to the curve. The Y and Z vectors are free to rotate around the curve.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..PointElementReference Autodesk.Revit.DB..::..PointOnEdge
# See Also
PointOnEdge Members
Autodesk.Revit.DB Namespace